waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_pmu.h
/**
  *******************************************************************************************************
  * @file    fm33fk5xx_fl_pmu.h
  * @author  FMSH Application Team
  * @brief   Head file of PMU FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FK5XX_FL_PMU_H
#define __FM33FK5XX_FL_PMU_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fk5xx_fl_def.h"
/** @addtogroup FM33FK5XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup PMU_FL_ES_INIT PMU Exported Init structures
  * @{
  */

/**
  * @brief FL PMU Init Sturcture definition
  */
typedef struct
{
    /* 低功耗模式配置 */
    uint32_t powerMode;
    /* 睡眠模式配置 */
    uint32_t sleepMode ;
    /* 唤醒后的系统频率，仅对RCHF */
    uint32_t wakeupFrequency;
    /* AVREF采样保持时间 */
    uint32_t avrefHoldTime;
    /* ram0电源控制 */
    uint32_t ram0PowerControl;
    /* ram1电源控制 */
    uint32_t ram1PowerControl;
    /* cache data ram电源控制 */
    uint32_t cacheDramPowerControl;
    /*  cache tag ram电源控制 */
    uint32_t cacheTramPowerControl;

} FL_PMU_SleepInitTypeDef;

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup PMU_FL_Exported_Constants PMU Exported Constants
  * @{
  */

#define    PMU_CR_SRPG_RST_EN_Pos                                 (30U)
#define    PMU_CR_SRPG_RST_EN_Msk                                 (0x1U << PMU_CR_SRPG_RST_EN_Pos)
#define    PMU_CR_SRPG_RST_EN                                     PMU_CR_SRPG_RST_EN_Msk

#define    PMU_CR_AVREF_SH_Pos                                    (24U)
#define    PMU_CR_AVREF_SH_Msk                                    (0x3U << PMU_CR_AVREF_SH_Pos)
#define    PMU_CR_AVREF_SH                                        PMU_CR_AVREF_SH_Msk

#define    PMU_CR_WKFSEL_Pos                                      (10U)
#define    PMU_CR_WKFSEL_Msk                                      (0x3U << PMU_CR_WKFSEL_Pos)
#define    PMU_CR_WKFSEL                                          PMU_CR_WKFSEL_Msk

#define    PMU_CR_SLPDP_Pos                                       (9U)
#define    PMU_CR_SLPDP_Msk                                       (0x1U << PMU_CR_SLPDP_Pos)
#define    PMU_CR_SLPDP                                           PMU_CR_SLPDP_Msk

#define    PMU_CR_PMOD_Pos                                        (0U)
#define    PMU_CR_PMOD_Msk                                        (0x3U << PMU_CR_PMOD_Pos)
#define    PMU_CR_PMOD                                            PMU_CR_PMOD_Msk

#define    PMU_WKTR_T2B_Pos                                       (6U)
#define    PMU_WKTR_T2B_Msk                                       (0x3U << PMU_WKTR_T2B_Pos)
#define    PMU_WKTR_T2B                                           PMU_WKTR_T2B_Msk

#define    PMU_WKTR_T2A_Pos                                       (4U)
#define    PMU_WKTR_T2A_Msk                                       (0x3U << PMU_WKTR_T2A_Pos)
#define    PMU_WKTR_T2A                                           PMU_WKTR_T2A_Msk

#define    PMU_WKTR_STPCLR_Pos                                    (2U)
#define    PMU_WKTR_STPCLR_Msk                                    (0x1U << PMU_WKTR_STPCLR_Pos)
#define    PMU_WKTR_STPCLR                                        PMU_WKTR_STPCLR_Msk

#define    PMU_WKTR_T1A_Pos                                       (0U)
#define    PMU_WKTR_T1A_Msk                                       (0x3U << PMU_WKTR_T1A_Pos)
#define    PMU_WKTR_T1A                                           PMU_WKTR_T1A_Msk

#define    PMU_WKFR1_RTCWKF_Pos                                    (28U)
#define    PMU_WKFR1_RTCWKF_Msk                                    (0x1U << PMU_WKFR1_RTCWKF_Pos)
#define    PMU_WKFR1_RTCWKF                                        PMU_WKFR1_RTCWKF_Msk

#define    PMU_WKFR1_SVDWKF_Pos                                    (27U)
#define    PMU_WKFR1_SVDWKF_Msk                                    (0x1U << PMU_WKFR1_SVDWKF_Pos)
#define    PMU_WKFR1_SVDWKF                                        PMU_WKFR1_SVDWKF_Msk

#define    PMU_WKFR1_LFDETWKF_Pos                                  (26U)
#define    PMU_WKFR1_LFDETWKF_Msk                                  (0x1U << PMU_WKFR1_LFDETWKF_Pos)
#define    PMU_WKFR1_LFDETWKF                                      PMU_WKFR1_LFDETWKF_Msk

#define    PMU_WKFR1_IOWKF_Pos                                     (24U)
#define    PMU_WKFR1_IOWKF_Msk                                     (0x1U << PMU_WKFR1_IOWKF_Pos)
#define    PMU_WKFR1_IOWKF                                         PMU_WKFR1_IOWKF_Msk

#define    PMU_WKFR1_I2CSMB2WKF_Pos                                (23U)
#define    PMU_WKFR1_I2CSMB2WKF_Msk                                (0x1U << PMU_WKFR1_I2CSMB2WKF_Pos)
#define    PMU_WKFR1_I2CSMB2WKF                                    PMU_WKFR1_I2CSMB2WKF_Msk

#define    PMU_WKFR1_I2CSMB1WKF_Pos                                (22U)
#define    PMU_WKFR1_I2CSMB1WKF_Msk                                (0x1U << PMU_WKFR1_I2CSMB1WKF_Pos)
#define    PMU_WKFR1_I2CSMB1WKF                                    PMU_WKFR1_I2CSMB1WKF_Msk

