waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_pmu.h
#define    PMU_WKFR1_I2CSMB0WKF_Pos                                (21U)
#define    PMU_WKFR1_I2CSMB0WKF_Msk                                (0x1U << PMU_WKFR1_I2CSMB0WKF_Pos)
#define    PMU_WKFR1_I2CSMB0WKF                                    PMU_WKFR1_I2CSMB0WKF_Msk

#define    PMU_WKFR1_FSCANWKF_Pos                                   (20U)
#define    PMU_WKFR1_FSCANWKF_Msk                                   (0x1U << PMU_WKFR1_FSCANWKF_Pos)
#define    PMU_WKFR1_FSCANWKF                                       PMU_WKFR1_FSCANWKF_Msk

#define    PMU_WKFR1_FDCANWKF_Pos                                   (19U)
#define    PMU_WKFR1_FDCANWKF_Msk                                   (0x1U << PMU_WKFR1_FDCANWKF_Pos)
#define    PMU_WKFR1_FDCANWKF                                       PMU_WKFR1_FDCANWKF_Msk

#define    PMU_WKFR1_COMP2WKF_Pos                                  (18U)
#define    PMU_WKFR1_COMP2WKF_Msk                                  (0x1U << PMU_WKFR1_COMP2WKF_Pos)
#define    PMU_WKFR1_COMP2WKF                                      PMU_WKFR1_COMP2WKF_Msk

#define    PMU_WKFR1_COMP1WKF_Pos                                  (17U)
#define    PMU_WKFR1_COMP1WKF_Msk                                  (0x1U << PMU_WKFR1_COMP1WKF_Pos)
#define    PMU_WKFR1_COMP1WKF                                      PMU_WKFR1_COMP1WKF_Msk

#define    PMU_WKFR1_COMP0WKF_Pos                                  (16U)
#define    PMU_WKFR1_COMP0WKF_Msk                                  (0x1U << PMU_WKFR1_COMP0WKF_Pos)
#define    PMU_WKFR1_COMP0WKF                                      PMU_WKFR1_COMP0WKF_Msk

#define    PMU_WKFR1_UART3_LINWKF_Pos                              (15U)
#define    PMU_WKFR1_UART3_LINWKF_Msk                              (0x1U << PMU_WKFR1_UART3_LINWKF_Pos)
#define    PMU_WKFR1_UART3_LINWKF                                  PMU_WKFR1_UART3_LINWKF_Msk

#define    PMU_WKFR1_UART2_LINWKF_Pos                              (14U)
#define    PMU_WKFR1_UART2_LINWKF_Msk                              (0x1U << PMU_WKFR1_UART2_LINWKF_Pos)
#define    PMU_WKFR1_UART2_LINWKF                                  PMU_WKFR1_UART2_LINWKF_Msk

#define    PMU_WKFR1_UART1_LINWKF_Pos                              (13U)
#define    PMU_WKFR1_UART1_LINWKF_Msk                              (0x1U << PMU_WKFR1_UART1_LINWKF_Pos)
#define    PMU_WKFR1_UART1_LINWKF                                  PMU_WKFR1_UART1_LINWKF_Msk

#define    PMU_WKFR1_UART0_LINWKF_Pos                              (12U)
#define    PMU_WKFR1_UART0_LINWKF_Msk                              (0x1U << PMU_WKFR1_UART0_LINWKF_Pos)
#define    PMU_WKFR1_UART0_LINWKF                                  PMU_WKFR1_UART0_LINWKF_Msk

#define    PMU_WKFR1_LPT16WKF_Pos                                  (11U)
#define    PMU_WKFR1_LPT16WKF_Msk                                  (0x1U << PMU_WKFR1_LPT16WKF_Pos)
#define    PMU_WKFR1_LPT16WKF                                      PMU_WKFR1_LPT16WKF_Msk

#define    PMU_WKFR1_BST16WKF_Pos                                  (10U)
#define    PMU_WKFR1_BST16WKF_Msk                                  (0x1U << PMU_WKFR1_BST16WKF_Pos)
#define    PMU_WKFR1_BST16WKF                                      PMU_WKFR1_BST16WKF_Msk

#define    PMU_WKFR1_DBGWKF_Pos                                    (8U)
#define    PMU_WKFR1_DBGWKF_Msk                                    (0x1U << PMU_WKFR1_DBGWKF_Pos)
#define    PMU_WKFR1_DBGWKF                                        PMU_WKFR1_DBGWKF_Msk

#define    PMU_WKFR1_UART3WKF_Pos                                  (7U)
#define    PMU_WKFR1_UART3WKF_Msk                                  (0x1U << PMU_WKFR1_UART3WKF_Pos)
#define    PMU_WKFR1_UART3WKF                                      PMU_WKFR1_UART3WKF_Msk

#define    PMU_WKFR1_UART2WKF_Pos                                  (6U)
#define    PMU_WKFR1_UART2WKF_Msk                                  (0x1U << PMU_WKFR1_UART2WKF_Pos)
#define    PMU_WKFR1_UART2WKF                                      PMU_WKFR1_UART2WKF_Msk

#define    PMU_WKFR1_UART1WKF_Pos                                  (5U)
#define    PMU_WKFR1_UART1WKF_Msk                                  (0x1U << PMU_WKFR1_UART1WKF_Pos)
#define    PMU_WKFR1_UART1WKF                                      PMU_WKFR1_UART1WKF_Msk

#define    PMU_WKFR1_UART0WKF_Pos                                  (4U)
#define    PMU_WKFR1_UART0WKF_Msk                                  (0x1U << PMU_WKFR1_UART0WKF_Pos)
#define    PMU_WKFR1_UART0WKF                                      PMU_WKFR1_UART0WKF_Msk

#define    PMU_WKFR1_LPU1WKF_Pos                                   (1U)
#define    PMU_WKFR1_LPU1WKF_Msk                                   (0x1U << PMU_WKFR1_LPU1WKF_Pos)
#define    PMU_WKFR1_LPU1WKF                                       PMU_WKFR1_LPU1WKF_Msk

#define    PMU_WKFR1_LPU0WKF_Pos                                   (0U)
#define    PMU_WKFR1_LPU0WKF_Msk                                   (0x1U << PMU_WKFR1_LPU0WKF_Pos)
#define    PMU_WKFR1_LPU0WKF                                       PMU_WKFR1_LPU0WKF_Msk

#define    PMU_WKFR2_WKPXF_Pos                                    (0U)
#define    PMU_WKFR2_WKPXF_Msk                                    (0xffU << PMU_WKFR2_WKPXF_Pos)
#define    PMU_WKFR2_WKPXF                                        PMU_WKFR2_WKPXF_Msk

#define    PMU_RAMCR_CTRAMPG_Pos                                  (6U)
#define    PMU_RAMCR_CTRAMPG_Msk                                  (0x3U << PMU_RAMCR_CTRAMPG_Pos)
#define    PMU_RAMCR_CTRAMPG                                      PMU_RAMCR_CTRAMPG_Msk

#define    PMU_RAMCR_CDRAMPG_Pos                                  (4U)
#define    PMU_RAMCR_CDRAMPG_Msk                                  (0x3U << PMU_RAMCR_CDRAMPG_Pos)
#define    PMU_RAMCR_CDRAMPG                                      PMU_RAMCR_CDRAMPG_Msk

#define    PMU_RAMCR_RAM1PG_Pos                                   (2U)
#define    PMU_RAMCR_RAM1PG_Msk                                   (0x3U << PMU_RAMCR_RAM1PG_Pos)
#define    PMU_RAMCR_RAM1PG                                       PMU_RAMCR_RAM1PG_Msk

#define    PMU_RAMCR_RAM0PG_Pos                                   (0U)
#define    PMU_RAMCR_RAM0PG_Msk                                   (0x3U << PMU_RAMCR_RAM0PG_Pos)
#define    PMU_RAMCR_RAM0PG                                       PMU_RAMCR_RAM0PG_Msk

#define    PMU_BUFCR_AVREFBUF_OUTEN_Pos                           (5U)
#define    PMU_BUFCR_AVREFBUF_OUTEN_Msk                           (0x1U << PMU_BUFCR_AVREFBUF_OUTEN_Pos)
#define    PMU_BUFCR_AVREFBUF_OUTEN                               PMU_BUFCR_AVREFBUF_OUTEN_Msk

#define    PMU_BUFCR_AVREFBUF_EN_Pos                              (4U)
#define    PMU_BUFCR_AVREFBUF_EN_Msk                              (0x1U << PMU_BUFCR_AVREFBUF_EN_Pos)
#define    PMU_BUFCR_AVREFBUF_EN                                  PMU_BUFCR_AVREFBUF_EN_Msk

#define    PMU_BUFCR_VPTATBUFFER_OUTEN_Pos                        (3U)
#define    PMU_BUFCR_VPTATBUFFER_OUTEN_Msk                        (0x1U << PMU_BUFCR_VPTATBUFFER_OUTEN_Pos)
#define    PMU_BUFCR_VPTATBUFFER_OUTEN                            PMU_BUFCR_VPTATBUFFER_OUTEN_Msk

#define    PMU_BUFCR_VPTATBUFFER_EN_Pos                           (2U)
#define    PMU_BUFCR_VPTATBUFFER_EN_Msk                           (0x1U << PMU_BUFCR_VPTATBUFFER_EN_Pos)
#define    PMU_BUFCR_VPTATBUFFER_EN                               PMU_BUFCR_VPTATBUFFER_EN_Msk

#define    PMU_PHYCR_PONRSTB_Pos                                  (1U)
#define    PMU_PHYCR_PONRSTB_Msk                                  (0x1U << PMU_PHYCR_PONRSTB_Pos)
#define    PMU_PHYCR_PONRSTB                                      PMU_PHYCR_PONRSTB_Msk

#define    PMU_PHYCR_PLVRDY_Pos                                   (0U)
#define    PMU_PHYCR_PLVRDY_Msk                                   (0x1U << PMU_PHYCR_PLVRDY_Pos)
#define    PMU_PHYCR_PLVRDY                                       PMU_PHYCR_PLVRDY_Msk

#define    PMU_PTAT_CR_PTAT_EN_Pos                                (0U)
#define    PMU_PTAT_CR_PTAT_EN_Msk                                (0x1U << PMU_PTAT_CR_PTAT_EN_Pos)
#define    PMU_PTAT_CR_PTAT_EN                                    PMU_PTAT_CR_PTAT_EN_Msk

#define    FL_PMU_WAKEUP0_PIN                                     (0x1U << 0U)
#define    FL_PMU_WAKEUP1_PIN                                     (0x1U << 1U)
#define    FL_PMU_WAKEUP2_PIN                                     (0x1U << 2U)
#define    FL_PMU_WAKEUP3_PIN                                     (0x1U << 3U)
#define    FL_PMU_WAKEUP4_PIN                                     (0x1U << 4U)
#define    FL_PMU_WAKEUP5_PIN                                     (0x1U << 5U)
#define    FL_PMU_WAKEUP6_PIN                                     (0x1U << 6U)
#define    FL_PMU_WAKEUP7_PIN                                     (0x1U << 7U)

#define    FL_PMU_RCHF_WAKEUP_FREQ_8MHZ                           (0x0U << PMU_CR_WKFSEL_Pos)
#define    FL_PMU_RCHF_WAKEUP_FREQ_16MHZ                          (0x1U << PMU_CR_WKFSEL_Pos)
#define    FL_PMU_RCHF_WAKEUP_FREQ_24MHZ                          (0x2U << PMU_CR_WKFSEL_Pos)

