waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_pmu.h
/**
  * @brief    Clear pinx wakeup flag
  * @rmtoll   WKFR1    WKPXF    FL_PMU_ClearFlag_WakeupPIN
  * @param    PMUx PMU instance
  * @param    Pin This parameter can be one of the following values:
  *           @arg @ref FL_PMU_WAKEUP0_PIN
  *           @arg @ref FL_PMU_WAKEUP1_PIN
  *           @arg @ref FL_PMU_WAKEUP2_PIN
  *           @arg @ref FL_PMU_WAKEUP3_PIN
  *           @arg @ref FL_PMU_WAKEUP4_PIN
  *           @arg @ref FL_PMU_WAKEUP5_PIN
  *           @arg @ref FL_PMU_WAKEUP6_PIN
  *           @arg @ref FL_PMU_WAKEUP7_PIN
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_ClearFlag_WakeupPIN(PMU_Type *PMUx, uint32_t Pin)
{
    WRITE_REG(PMUx->WKFR2, ((Pin & 0xff) << 0x0U));
}

/**
  * @brief    Set cache tag ram Power control, sleep / deepsleep mode is valid
  * @rmtoll   RAMCR    CTRAMPG    FL_PMU_SetCacheTagRamPowerControl
  * @param    PMUx PMU instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_PMU_CTRAMPG_SLEEP_NORMAL_OR_DEEPSLEEP_RETENTION
  *           @arg @ref FL_PMU_CTRAMPG_SLEEP_NORMAL_OR_DEEPSLEEP_POWERDOWN
  *           @arg @ref FL_PMU_CTRAMPG_SLEEP_OR_DEEPSLEEP_RETENTION
  *           @arg @ref FL_PMU_CTRAMPG_SLEEP_OR_DEEPSLEEP_POWERDOWN
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_SetCacheTagRamPowerControl(PMU_Type *PMUx, uint32_t mode)
{
    MODIFY_REG(PMUx->RAMCR, PMU_RAMCR_CTRAMPG_Msk, mode);
}

/**
  * @brief    Get cache tag ram Power control, sleep / deepsleep mode is valid
  * @rmtoll   RAMCR    CTRAMPG    FL_PMU_GetCacheTagRamPowerControl
  * @param    PMUx PMU instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_PMU_CTRAMPG_SLEEP_NORMAL_OR_DEEPSLEEP_RETENTION
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_PMU_CTRAMPG_SLEEP_NORMAL_OR_DEEPSLEEP_RETENTION
  */
__STATIC_INLINE uint32_t FL_PMU_GetCacheTagRamPowerControl(PMU_Type *PMUx, uint32_t mode)
{
    return (uint32_t)(READ_BIT(PMUx->RAMCR, PMU_RAMCR_CTRAMPG_Msk));
}

/**
  * @brief    Set cache tag data Power control, sleep / deepsleep mode is valid
  * @rmtoll   RAMCR    CDRAMPG    FL_PMU_SetCacheDataRamPowerControl
  * @param    PMUx PMU instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_PMU_CDRAMPGPG_SLEEP_NORMAL_OR_DEEPSLEEP_RETENTION
  *           @arg @ref FL_PMU_CDRAMPGPG_SLEEP_NORMAL_OR_DEEPSLEEP_POWERDOWN
  *           @arg @ref FL_PMU_CDRAMPGPG_SLEEP_OR_DEEPSLEEP_RETENTION
  *           @arg @ref FL_PMU_CDRAMPGPG_SLEEP_OR_DEEPSLEEP_POWERDOWN
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_SetCacheDataRamPowerControl(PMU_Type *PMUx, uint32_t mode)
{
    MODIFY_REG(PMUx->RAMCR, PMU_RAMCR_CDRAMPG_Msk, mode);
}

/**
  * @brief    Get cache tag data Power control, sleep / deepsleep mode is valid
  * @rmtoll   RAMCR    CDRAMPG    FL_PMU_GetCacheDataRamPowerControl
  * @param    PMUx PMU instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_PMU_CDRAMPG_SLEEP_NORMAL_OR_DEEPSLEEP_RETENTION
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_PMU_CDRAMPG_SLEEP_NORMAL_OR_DEEPSLEEP_RETENTION
  */
__STATIC_INLINE uint32_t FL_PMU_GetCacheDataRamPowerControl(PMU_Type *PMUx, uint32_t mode)
{
    return (uint32_t)(READ_BIT(PMUx->RAMCR, PMU_RAMCR_CDRAMPG_Msk));
}

/**
  * @brief    Set Ram1 Power control, sleep / deepsleep mode is valid
  * @rmtoll   RAMCR    RAM1PG    FL_PMU_SetPdRam1PowerControl
  * @param    PMUx PMU instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_PMU_RAM1PG_SLEEP_NORMAL_OR_DEEPSLEEP_RETENTION
  *           @arg @ref FL_PMU_RAM1PG_SLEEP_NORMAL_OR_DEEPSLEEP_POWERDOWN
  *           @arg @ref FL_PMU_RAM1PG_SLEEP_OR_DEEPSLEEP_RETENTION
  *           @arg @ref FL_PMU_RAM1PG_SLEEP_OR_DEEPSLEEP_POWERDOWN
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_SetPdRam1PowerControl(PMU_Type *PMUx, uint32_t mode)
{
    MODIFY_REG(PMUx->RAMCR, PMU_RAMCR_RAM1PG_Msk, mode);
}

/**
  * @brief    Get Ram1 Power control, sleep / deepsleep mode is valid
  * @rmtoll   RAMCR    RAM1PG    FL_PMU_GetPdRam1PowerControl
  * @param    PMUx PMU instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_PMU_RAM1PG_SLEEP_NORMAL_OR_DEEPSLEEP_RETENTION
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_PMU_RAM1PG_SLEEP_NORMAL_OR_DEEPSLEEP_RETENTION
  */
__STATIC_INLINE uint32_t FL_PMU_GetPdRam1PowerControl(PMU_Type *PMUx, uint32_t mode)
{
    return (uint32_t)(READ_BIT(PMUx->RAMCR, PMU_RAMCR_RAM1PG_Msk));
}

/**
  * @brief    Set Ram0 Power control, sleep / deepsleep mode is valid
  * @rmtoll   RAMCR    RAM0PG    FL_PMU_SetPdRam0PowerControl
  * @param    PMUx PMU instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_PMU_RAM0PG_SLEEP_NORMAL_OR_DEEPSLEEP_RETENTION
  *           @arg @ref FL_PMU_RAM0PG_SLEEP_NORMAL_OR_DEEPSLEEP_POWERDOWN
  *           @arg @ref FL_PMU_RAM0PG_SLEEP_OR_DEEPSLEEP_RETENTION
  *           @arg @ref FL_PMU_RAM0PG_SLEEP_OR_DEEPSLEEP_POWERDOWN
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_SetPdRam0PowerControl(PMU_Type *PMUx, uint32_t mode)
{
    MODIFY_REG(PMUx->RAMCR, PMU_RAMCR_RAM0PG_Msk, mode);
}

/**
  * @brief    Get Ram0 Power control, sleep / deepsleep mode is valid
  * @rmtoll   RAMCR    RAM0PG    FL_PMU_GetPdRam0PowerControl
  * @param    PMUx PMU instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_PMU_RAM0PG_SLEEP_NORMAL_OR_DEEPSLEEP_RETENTION
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_PMU_RAM0PG_SLEEP_NORMAL_OR_DEEPSLEEP_RETENTION
  */
__STATIC_INLINE uint32_t FL_PMU_GetPdRam0PowerControl(PMU_Type *PMUx, uint32_t mode)
{
    return (uint32_t)(READ_BIT(PMUx->RAMCR, PMU_RAMCR_RAM0PG_Msk));
}

/**
  * @brief    Enable AVREF Buffer Output
  * @rmtoll   BUFCR    AVREFBUF_OUTEN    FL_PMU_EnableAVREFBufferOutput
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableAVREFBufferOutput(PMU_Type *PMUx)
{
    SET_BIT(PMUx->BUFCR, PMU_BUFCR_AVREFBUF_OUTEN_Msk);
}

/**
  * @brief    Get AVREF Buffer Output Enable Status
  * @rmtoll   BUFCR    AVREFBUF_OUTEN    FL_PMU_IsEnabledAVREFBufferOutput
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledAVREFBufferOutput(PMU_Type *PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->BUFCR, PMU_BUFCR_AVREFBUF_OUTEN_Msk) == PMU_BUFCR_AVREFBUF_OUTEN_Msk);
}

/**
  * @brief    Disable AVREF Buffer Output
  * @rmtoll   BUFCR    AVREFBUF_OUTEN    FL_PMU_DisableAVREFBufferOutput
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableAVREFBufferOutput(PMU_Type *PMUx)
{
    CLEAR_BIT(PMUx->BUFCR, PMU_BUFCR_AVREFBUF_OUTEN_Msk);
}

/**
  * @brief    Enable AVREF Buffer
  * @rmtoll   BUFCR    AVREFBUF_EN    FL_PMU_EnableAVREFBuffer
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableAVREFBuffer(PMU_Type *PMUx)
{
    SET_BIT(PMUx->BUFCR, PMU_BUFCR_AVREFBUF_EN_Msk);
}

/**
  * @brief    Get AVREF Buffer Enable Status
  * @rmtoll   BUFCR    AVREFBUF_EN    FL_PMU_IsEnabledAVREFBuffer
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledAVREFBuffer(PMU_Type *PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->BUFCR, PMU_BUFCR_AVREFBUF_EN_Msk) == PMU_BUFCR_AVREFBUF_EN_Msk);
}

/**
  * @brief    Disable AVREF Buffer
  * @rmtoll   BUFCR    AVREFBUF_EN    FL_PMU_DisableAVREFBuffer
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableAVREFBuffer(PMU_Type *PMUx)
{
    CLEAR_BIT(PMUx->BUFCR, PMU_BUFCR_AVREFBUF_EN_Msk);
}

/**
  * @brief    Enable VPTAT Buffer Output
  * @rmtoll   BUFCR    VPTATBUFFER_OUTEN    FL_PMU_EnableVPTATBufferOutput
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableVPTATBufferOutput(PMU_Type *PMUx)
{
    SET_BIT(PMUx->BUFCR, PMU_BUFCR_VPTATBUFFER_OUTEN_Msk);
}

/**
  * @brief    Get VPTAT Buffer Output Enable Status
  * @rmtoll   BUFCR    VPTATBUFFER_OUTEN    FL_PMU_IsEnabledVPTATBufferOutput
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledVPTATBufferOutput(PMU_Type *PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->BUFCR, PMU_BUFCR_VPTATBUFFER_OUTEN_Msk) == PMU_BUFCR_VPTATBUFFER_OUTEN_Msk);
}

/**
  * @brief    Disable VPTAT Buffer Output
  * @rmtoll   BUFCR    VPTATBUFFER_OUTEN    FL_PMU_DisableVPTATBufferOutput
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableVPTATBufferOutput(PMU_Type *PMUx)
{
    CLEAR_BIT(PMUx->BUFCR, PMU_BUFCR_VPTATBUFFER_OUTEN_Msk);
}

/**
  * @brief    Enable VPTAT Buffer
  * @rmtoll   BUFCR    VPTATBUFFER_EN    FL_PMU_EnableVPTATBuffer
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableVPTATBuffer(PMU_Type *PMUx)
{
    SET_BIT(PMUx->BUFCR, PMU_BUFCR_VPTATBUFFER_EN_Msk);
}

/**
  * @brief    Get VPTAT Buffer Enable Status
  * @rmtoll   BUFCR    VPTATBUFFER_EN    FL_PMU_IsEnabledVPTATBuffer
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledVPTATBuffer(PMU_Type *PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->BUFCR, PMU_BUFCR_VPTATBUFFER_EN_Msk) == PMU_BUFCR_VPTATBUFFER_EN_Msk);
}

/**
  * @brief    Disable VPTAT Buffer
  * @rmtoll   BUFCR    VPTATBUFFER_EN    FL_PMU_DisableVPTATBuffer
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableVPTATBuffer(PMU_Type *PMUx)
{
    CLEAR_BIT(PMUx->BUFCR, PMU_BUFCR_VPTATBUFFER_EN_Msk);
}

/**
  * @brief    Get USB PHY Enable Status
  * @rmtoll   PHYCR    PONRSTB    FL_PMU_IsActiveFlag_USBPHYReset
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsActiveFlag_USBPHYReset(PMU_Type *PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->PHYCR, PMU_PHYCR_PONRSTB_Msk) == (PMU_PHYCR_PONRSTB_Msk));
}

/**
  * @brief    Clear USB PHY Enable Status
  * @rmtoll   PHYCR    PONRSTB    FL_PMU_ClearFlag_USBPHYReset
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_ClearFlag_USBPHYReset(PMU_Type *PMUx)
{
    WRITE_REG(PMUx->PHYCR, PMU_PHYCR_PONRSTB_Msk);
}

/**
  * @brief    Get USB PHY Power Ready Flag
  * @rmtoll   PHYCR    PLVRDY    FL_PMU_IsActiveFlag_USBPHYPowerReadyFlag
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsActiveFlag_USBPHYPowerReadyFlag(PMU_Type *PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->PHYCR, PMU_PHYCR_PLVRDY_Msk) == (PMU_PHYCR_PLVRDY_Msk));
}

/**
  * @brief    Clear USB PHY Power Ready Flag
  * @rmtoll   PHYCR    PLVRDY    FL_PMU_ClearFlag_USBPHYPowerReadyFlag
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_ClearFlag_USBPHYPowerReadyFlag(PMU_Type *PMUx)
{
    WRITE_REG(PMUx->PHYCR, PMU_PHYCR_PLVRDY_Msk);
}

/**
  * @brief    Enable Temperatue Sensor
  * @rmtoll   PTAT_CR    PTAT_EN    FL_PMU_EnableTemperatureSensor
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_EnableTemperatureSensor(PMU_Type *PMUx)
{
    SET_BIT(PMUx->PTAT_CR, PMU_PTAT_CR_PTAT_EN_Msk);
}

/**
  * @brief    Get Temperatue Sensor Enable Status
  * @rmtoll   PTAT_CR    PTAT_EN    FL_PMU_IsEnabledTemperatureSensor
  * @param    PMUx PMU instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PMU_IsEnabledTemperatureSensor(PMU_Type *PMUx)
{
    return (uint32_t)(READ_BIT(PMUx->PTAT_CR, PMU_PTAT_CR_PTAT_EN_Msk) == PMU_PTAT_CR_PTAT_EN_Msk);
}

/**
  * @brief    Disable Temperatue Sensor
  * @rmtoll   PTAT_CR    PTAT_EN    FL_PMU_DisableTemperatureSensor
  * @param    PMUx PMU instance
  * @retval   None
  */
__STATIC_INLINE void FL_PMU_DisableTemperatureSensor(PMU_Type *PMUx)
{
    CLEAR_BIT(PMUx->PTAT_CR, PMU_PTAT_CR_PTAT_EN_Msk);
}

/**
  * @}
  */

/** @defgroup PMU_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_PMU_Sleep_DeInit(PMU_Type *PMUx);
FL_ErrorStatus FL_PMU_Sleep_Init(PMU_Type *PMUx, FL_PMU_SleepInitTypeDef *LPM_InitStruct);
void FL_PMU_StructInit(FL_PMU_SleepInitTypeDef *LPM_InitStruct);
/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FK5XX_FL_PMU_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2023-08-24*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
